package com.example.auto

object FriendsRepository {
    val friends: List<Person> = listOf(
        Person(id = 0, name = "Тони Старк", shortDescription = "Железный человек",
            longDescription = "Старк изначально изображён гениальным изобретателем, промышленником и плейбоем, генеральным директором компании «Stark Industries». Первоначально он являлся производителем оружия для вооружённых сил США, но впоследствии меняет своё мнение и перенаправляет свои технические знания на создание механизированных доспехов, которые он использует для защиты от тех, кто может угрожать миру во всём мире.",
            imgUrl = "https://img.championat.com/s/1350x900/news/big/s/w/byvshie-vladelcy-prav-na-zheleznogo-cheloveka-ne-verili-v-uspeh-ekranizacii_16634993301436527267.jpg"
        ),
        Person(id = 1, name = "Питер Паркер", shortDescription = "Человек-паук",
            longDescription = "Супергерой, появляющийся в комиксах издательства Marvel Comics, созданный Стэном Ли и Стивом Дитко. С момента своего первого появления на страницах комикса Amazing Fantasy № 15 он стал одним из самых популярных супергероев. Ли и Дитко задумывали персонажа как подростка-сироту, воспитанного дядей и тётей, совмещающего жизнь обычного студента и борца с преступностью. Человек-паук получил суперсилу, увеличенную ловкость, «паучье чутьё», а также способность держаться на отвесных поверхностях и выпускать паутину из рук с использованием прибора собственного изобретения",
            imgUrl = "https://img.razrisyika.ru/kart/140/1200/557414-chel-pauk-15.jpg"
        ),
        Person(id = 2, name = "Стив Роджерс", shortDescription = "Капитан Америка",
            longDescription = "Супергерой комиксов издательства Marvel Comics, являющийся одним из самых известных персонажей в мире комиксов. Он был создан писателем Джо Саймоном и художником Джеком Кирби и впервые появился в комиксах 1940-х Timely Comics. За годы в общей сложности в 75 странах было продано около 210 миллионов копий комиксов Captain America",
            imgUrl = "https://www.pixel4k.com/preview.php?src=https://www.pixel4k.com/wp-content/uploads/2021/04/avengers-4-captain-america-4k_1619216301.jpg"
        ),
        Person(id = 3, name = "Брюс Бэннер", shortDescription = "Халк",
            longDescription = "Во время экспериментального взрыва гамма-бомбы учёный Брюс Бэннер бросился спасать подростка, приехавшего на испытательный полигон. Столкнув мальчишку, Рика Джонса, в траншею, сам Бэннер оказался во взрыве, получив массивную дозу радиации. Позже он очнулся в лазарете, казалось, сравнительно невредимым, но ночью преобразовался в громоздкую серую форму, проломил стену и сбежал. Солдат из последовавшей поисковой партии назвал неопознанное создание «громадиной»",
            imgUrl = "https://i.pinimg.com/originals/19/e5/3d/19e53d88626b290bb5c67a0696e0044e.jpg"
        ),
        Person(id = 4, name = "Ванда Максимофф", shortDescription = "Алая Ведьма",
            longDescription = "Ванда родилась в Заковии вместе со своим братом-близнецом Пьетро. В детстве Ванда и Пьетро теряют родителей, однако сами выживают при помощи магии Ванды. Позже добровольно соглашаются на эксперименты преступной организации «Гидра». Камень Разума усиливает её естественные способности к телекинезу и манипулированию энергией.",
            imgUrl = "https://avatars.mds.yandex.net/get-entity_search/1380855/850918768/S600xU_2x"
        ),
        Person(id = 5, name = "Пьетро Максимофф", shortDescription = "Ртуть",
            longDescription = "Пьетро вместе со своей сестрой-двойняшкой Вандой родился в Заковии. Будучи детьми, они осиротели от ракет технологии Тони Старка, однако им удалось выжить при помощи магии Ванды. Позже они добровольно соглашаются на эксперименты преступной организации «Гидра». В результате воздействия Камня Разума Пьетро приобретает способность передвигаться со сверхчеловеческой скоростью.",
            imgUrl = "https://avatars.mds.yandex.net/get-entity_search/10843572/821683130/S600xU_2x"
        ),
        Person(id = 6, name = "Баки Барнс", shortDescription = "Зимний солдат",
            longDescription = "После экспериментов КГБ ему дали прозвище «Зимний солдат». Зимнего солдата погружали в криогенный сон, пока Гидра не считала нужным разморозить его и отправить на задание.\n" +
                    "За 50 лет Зимний солдат совершил множество убийств, устранял различного рода цели, начиная от гениальных ученых и заканчивая влиятельными политиками.\n" +
                    "Скрытные методы Зимнего солдата и его неуловимость сделали его своего рода городской легендой, и разведывательные агентства даже сомневались, что он существует на самом деле.",
            imgUrl = "https://avatars.mds.yandex.net/get-entity_search/2368666/791405759/S600xU_2x"
        ),
    )

}